{
  "reviews": [
    {
      "reviewer": {
        "displayName": "Michelle Ronda"
      },
      "starRating": "FIVE",
      "comment": "Trish introduced me to the power of high performance and influence. She opened my eyes to countless opportunities for personal and professional growth. For over three years, she coached me through challenges, breakthroughs, and meaningful transformation—not just in my career but in who I am. She pushed me beyond the limits I had set for myself and believed in me when I didn’t believe in myself. Because of her support, I accomplished things I never thought I could. Her guidance has grown my confidence, my company, and my mindset. But Trish isn’t just my coach—she’s also a great friend. She’s someone I can always rely on, and her presence in my life has been nothing short of a gift. I'm incredibly grateful for everything she’s helped me become.",
      "createTime": "",
      "updateTime": "",
      "name": ""
    },
    {
      "reviewer": {
        "displayName": "Bryan Gilreath"
      },
      "starRating": "FIVE",
      "comment": "I've utilized Trisha's services on a number of occasions and found her work to be highly effective, with a strong emphasis on both leadership development and neurolinguistics. Clients highlight her ability to facilitate insightful realizations and drive significant positive change, resulting in improved communication, team dynamics, and overall business outcomes. Her coaching empowers individuals to achieve their goals and advance their careers, while also fostering a more inspiring and productive work environment.",
      "createTime": "",
      "updateTime": "",
      "name": ""
    },
    {
      "reviewer": {
        "displayName": "Jonathan Kraker"
      },
      "starRating": "FIVE",
      "comment": "My business would not be where it is, today, without Trisha's coaching. Her consistency, knowledge, and supportive approach have been a driver for me to stay the path and keep going when things have felt really difficult. I've learned a lot from her as I am a solo owner/operator and now have systems and processes (among other things) that have helped my business grow and helped me make money and make a difference in the lives of my own clients.",
      "createTime": "",
      "updateTime": "",
      "name": ""
    },
    {
      "reviewer": {
        "displayName": "L T"
      },
      "starRating": "FIVE",
      "comment": "Working with Trisha for almost 5 years has been nothing short of life-changing. She is so much more than a coach—she is my lifeline, my guide, my support system through every challenge life throws at me. As a mom, wife, entrepreneur, and woman juggling it all, Trisha has been the one constant who has kept me grounded and focused, no matter how overwhelming things get. Each week, Trisha and I dive deep. Whether it’s working through a high-performance worksheet, practicing meditation, or reflecting on my growth, Trisha has pushed me to look inside myself, to dig deeper than I ever thought possible, and to become a better version of me. She has shown me how to stay positive, confident, and balanced, even when life feels like a whirlwind. Without her, I truly don’t know where I would be right now. But it’s not just about me—Trisha has had a profound impact on my team at BestBuds Dispensary in Woodbury, NJ as well. She has helped me train, inspire, and empower my employees to reach their highest potential. Her leadership coaching has transformed our workplace, making it more productive, more connected, and more aligned with our shared goals. From team dynamics to management strategies, Trisha’s guidance has been absolutely transformative. The work we’ve done together isn’t always easy—it takes vulnerability, hard work, and real commitment—but every step of the way, Trisha has helped me become stronger, more intentional, and more aligned with the woman and leader I strive to be. I can’t imagine my journey without her by my side. I will continue to work with Trisha for the rest of my life, and if you're looking for someone who will push you, support you, and help you grow beyond what you thought was possible, Trisha is the coach you NEED.",
      "createTime": "",
      "updateTime": "",
      "name": ""
    },
    {
      "reviewer": {
        "displayName": "art_tho Romeo"
      },
      "starRating": "FIVE",
      "comment": "Trisha is very experienced and easy to work with. She asks me very solid questions that make me consider my business positions and think about my approach to objectives. She is very truthworthy and has a great listening ear. She is also very flexible on times and meetings. 10/10 is a great human to work with.",
      "createTime": "",
      "updateTime": "",
      "name": ""
    },
    {
      "reviewer": {
        "displayName": "Renee"
      },
      "starRating": "FIVE",
      "comment": "My experience working with Trish has been life changing. She has really helped me learn and apply tools to help me grow professionally and personally. I am so grateful for her expertise!",
      "createTime": "",
      "updateTime": "",
      "name": ""
    },
    {
      "reviewer": {
        "displayName": "Megan Johnson"
      },
      "starRating": "FIVE",
      "comment": "I am incredibly grateful for Trisha's leadership coaching. Working with her has led to amazing results for myself and my nursing team. Learning about my leadership style and foundational leadership characteristics has helped me to communicate better, show up authentically, with confidence, and consistency. With Trisha's coaching, I have led my team to success including decreased staff turnover and improved patient outcomes, while maintaining my own well-being. Trisha is the accountability partner I needed to succeed!",
      "createTime": "",
      "updateTime": "",
      "name": ""
    },
    {
      "reviewer": {
        "displayName": "Danielle Stahl"
      },
      "starRating": "FIVE",
      "comment": "Trisha is the best. She is so smart and really knows what she is doing.",
      "createTime": "",
      "updateTime": "",
      "name": ""
    },
    {
      "reviewer": {
        "displayName": "Brittany Dickson"
      },
      "starRating": "FIVE",
      "comment": "Trish is a wonderful human and listener. She really understands people and is filled with goodness. You’re in good hands with her!",
      "createTime": "",
      "updateTime": "",
      "name": ""
    },
    {
      "reviewer": {
        "displayName": "Anna Drow"
      },
      "starRating": "FIVE",
      "comment": "I have known Trisha in both a personal and professional capacity for many years. She is continuously learning and perfecting her craft. Trustworthy, confident, empowering, and results oriented are words I would use to describe her. If you are interested in growing and need support, Trisha will guide you to the next level. I highly recommend working with her.",
      "createTime": "",
      "updateTime": "",
      "name": ""
    }
  ]
}